tutorials/cfdemSolverIBContinuousForcing/redBloodCellPoiseuilleFlow/CFD/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0); // velocity in micrometres per second

boundaryField
{
    inlet
    {
        type            cyclicAMI;
    }

    outlet
    {
        type            cyclicAMI;
    }

    channelWall
    {
        type            noSlip;
    }
}

// ************************************************************************* //
