tutorials/cfdemSolverIBContinuousForcing/redBloodCellPoiseuilleFlow/CFD/0/lambda
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      lambda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 10; // Value to be determined based on CFD time-step.
// The ratio between lambda/dt > 1 at all times to achieve proper forcing of the momentum equation.

boundaryField
{
    inlet
    {
        type            cyclicAMI;
    }

    outlet
    {
        type            cyclicAMI;
    }

    channelWall
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
